Tekla Open API Reference for Tekla Structures 2025
BaseWeld.ContourBelow Property
 Gets or sets the contour below.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldContourEnum ContourBelow { get; set; }
Public Property ContourBelow As BaseWeld.WeldContourEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldContourEnum
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace